Revit 2027 API
CurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As CurveArrayIterator
public:
virtual CurveArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CurveArrayIterator
override ReverseIterator : unit -> CurveArrayIterator
Return Value
CurveArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
CurveArray Class
Autodesk.Revit.DB Namespace